Revit 2026 API

# BaseImportOptionsSetLayerSelection Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayerSelection(
	ICollection<string> layerSelection
)
```
```vb
Public Sub SetLayerSelection (
	layerSelection As ICollection(Of String)
)
```
```cpp
public:
void SetLayerSelection(
	ICollection<String^>^ layerSelection
)
```
```fsharp
member SetLayerSelection :
        layerSelection : ICollection<string> -> unit
```

#### Parameters

layerSelection ICollectionString

#### Reference

BaseImportOptions Class

Autodesk.Revit.DB Namespace